In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
company=["A","B","C"]

data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)})
    
data

  company  salary  age
0       A      34   27
1       A      41   45
2       C      21   49
3       C      40   16
4       B      25   38
5       A      35   26
6       A      40   40
7       C      34   21
8       B      13   25
9       C       7   40

In [4]:
group = data.groupby('company')

In [5]:
list(group)

[('A',
    company  salary  age
  0       A      34   27
  1       A      41   45
  5       A      35   26
  6       A      40   40),
 ('B',
    company  salary  age
  4       B      25   38
  8       B      13   25),
 ('C',
    company  salary  age
  2       C      21   49
  3       C      40   16
  7       C      34   21
  9       C       7   40)]

In [6]:
data.groupby('company').agg('mean')

         salary   age
company
A          37.5  34.5
B          19.0  31.5
C          25.5  31.5

In [7]:
data.groupby('company').agg('count')

         salary  age
company
A             4    4
B             2    2
C             4    4

In [8]:
data.groupby('company').agg({'salary': 'median', 'age': 'mean'})

         salary   age
company
A          37.5  34.5
B          19.0  31.5
C          27.5  31.5

In [14]:
avg_salary_dict = data.groupby('company')['salary'].mean().to_dict()
print(avg_salary_dict)
data['avg_salary'] = data['company'].map(avg_salary_dict)
print(data[['company', 'avg_salary']])

{'A': 37.5, 'B': 19.0, 'C': 25.5}
  company  avg_salary
0       A        37.5
1       A        37.5
2       C        25.5
3       C        25.5
4       B        19.0
5       A        37.5
6       A        37.5
7       C        25.5
8       B        19.0
9       C        25.5

In [15]:
data['avg_salary'] = data.groupby('company')['salary'].transform('mean')
data